publish/word-break.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-27 Fri 20:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>word-break: break-all;</title>
<meta name="author" content="Spike Leung" />
<meta name="description" content="&quot;&quot;" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung/taxodium/tree/org-publish">GitHub</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">word-break: break-all;</h1>
<p>
开发中碰到一个问题，有一个信息字段，label 不换行，value 如果比较长就换行。
</p>

<p>
一直以为只要设置 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/word-break#break-all">word-break: break-all;</a> 就万事大吉，但碰到恰好全是英文句号(<code>.</code> )的时候，失效了。
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #531ab6;">!DOCTYPE</span> html&gt;
&lt;<span style="color: #721045;">html</span>&gt;
  &lt;<span style="color: #721045;">head</span>&gt;
    &lt;<span style="color: #721045;">style</span>&gt;
    .box {
      width: 200px;
      border: 1px solid <span style="color: #ffffff; background-color: #000;">#000</span>;
    }

    .value {
      word-break: break-all;
    }
    &lt;/<span style="color: #721045;">style</span>&gt;
  &lt;/<span style="color: #721045;">head</span>&gt;
  &lt;<span style="color: #721045;">body</span>&gt;
    &lt;<span style="color: #721045;">div</span> <span style="color: #005e8b;">class</span>=<span style="color: #3548cf;">"box"</span>&gt;
      &lt;<span style="color: #721045;">span</span> <span style="color: #005e8b;">class</span>=<span style="color: #3548cf;">"label"</span>&gt;label:&lt;/<span style="color: #721045;">span</span>&gt;&lt;<span style="color: #721045;">span</span> <span style="color: #005e8b;">class</span>=<span style="color: #3548cf;">"value"</span>&gt;...................................................................................&lt;/<span style="color: #721045;">span</span>&gt;
    &lt;/<span style="color: #721045;">div</span>&gt;
  &lt;/<span style="color: #721045;">body</span>&gt;
&lt;/<span style="color: #721045;">html</span>&gt;
</pre>
</div>

<iframe style="width: 100%" srcdoc="&lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;style&gt; .box {width: 200px; border: 1px solid #000;} .value {word-break: break-all;} &lt;/style&gt; &lt;/head&gt; &lt;body&gt; &lt;div class=&#34;box&#34;&gt; &lt;span class=&#34;label&#34;&gt;label:&lt;/span&gt;&lt;span class=&#34;value&#34;&gt;...................................................................................&lt;/span&gt; &lt;/div&gt; &lt;/body&gt; &lt;/html&gt;"></iframe>

<p>
其实这是一个边界场景，因为内容都是标点符号(<code>.</code>)，规范中规定，对于 <code>word-break: break-all;</code> 在标点之间不会考虑换行：
</p>

<blockquote>
<p>
This value does not affect whether there are soft wrap opportunities around punctuation characters.
To allow breaks anywhere, see line-break: anywhere. <a href="https://drafts.csswg.org/css-text/#word-break-property">Source</a>
</p>
</blockquote>

<p>
为了解决，可以使用 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/line-break#anywhere">line-break: anywhere;</a> 或者 <a href="https://developer.mozilla.org/en-US/docs/Web/CSS/overflow-wrap#anywhere">overflow-wrap: anywhere;</a>。
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #531ab6;">!DOCTYPE</span> html&gt;
&lt;<span style="color: #721045;">html</span>&gt;
  &lt;<span style="color: #721045;">head</span>&gt;
    &lt;<span style="color: #721045;">style</span>&gt;
    .box {
      width: 200px;
      border: 1px solid <span style="color: #ffffff; background-color: #000;">#000</span>;
    }

    .value {
      word-break: break-all;
      line-break: anywhere;
    }
    &lt;/<span style="color: #721045;">style</span>&gt;
  &lt;/<span style="color: #721045;">head</span>&gt;
  &lt;<span style="color: #721045;">body</span>&gt;
    &lt;<span style="color: #721045;">div</span> <span style="color: #005e8b;">class</span>=<span style="color: #3548cf;">"box"</span>&gt;
      &lt;<span style="color: #721045;">span</span> <span style="color: #005e8b;">class</span>=<span style="color: #3548cf;">"label"</span>&gt;label:&lt;/<span style="color: #721045;">span</span>&gt;&lt;<span style="color: #721045;">span</span> <span style="color: #005e8b;">class</span>=<span style="color: #3548cf;">"value"</span>&gt;...................................................................................&lt;/<span style="color: #721045;">span</span>&gt;
    &lt;/<span style="color: #721045;">div</span>&gt;
  &lt;/<span style="color: #721045;">body</span>&gt;
&lt;/<span style="color: #721045;">html</span>&gt;
</pre>
</div>

<iframe style="width:100%" srcdoc="&lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;style&gt; .box {width: 200px; border: 1px solid #000;} .value {word-break: break-all; line-break: anywhere;} &lt;/style&gt; &lt;/head&gt; &lt;body&gt; &lt;div class=&#34;box&#34;&gt; &lt;span class=&#34;label&#34;&gt;label:&lt;/span&gt;&lt;span class=&#34;value&#34;&gt;...................................................................................&lt;/span&gt; &lt;/div&gt; &lt;/body&gt; &lt;/html&gt;"></iframe>

<p>
对于普通的内容，其实 <code>word-break: break-all;</code> 是没问题的。
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #531ab6;">!DOCTYPE</span> html&gt;
&lt;<span style="color: #721045;">html</span>&gt;
  &lt;<span style="color: #721045;">head</span>&gt;
    &lt;<span style="color: #721045;">style</span>&gt;
    .box {
      width: 200px;
      border: 1px solid <span style="color: #ffffff; background-color: #000;">#000</span>;
    }

    .value {
      word-break: break-all;
    }
    &lt;/<span style="color: #721045;">style</span>&gt;
  &lt;/<span style="color: #721045;">head</span>&gt;
  &lt;<span style="color: #721045;">body</span>&gt;
    &lt;<span style="color: #721045;">div</span> <span style="color: #005e8b;">class</span>=<span style="color: #3548cf;">"box"</span>&gt;
      &lt;<span style="color: #721045;">span</span> <span style="color: #005e8b;">class</span>=<span style="color: #3548cf;">"label"</span>&gt;label:&lt;/<span style="color: #721045;">span</span>&gt;&lt;<span style="color: #721045;">span</span> <span style="color: #005e8b;">class</span>=<span style="color: #3548cf;">"value"</span>&gt;Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.&lt;/<span style="color: #721045;">span</span>&gt;
    &lt;/<span style="color: #721045;">div</span>&gt;
  &lt;/<span style="color: #721045;">body</span>&gt;
&lt;/<span style="color: #721045;">html</span>&gt;
</pre>
</div>
<iframe style="width: 100%" srcdoc="&lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;style&gt; .box {width: 200px; border: 1px solid #000;} .value {word-break: break-all;} &lt;/style&gt; &lt;/head&gt; &lt;body&gt; &lt;div class=&#34;box&#34;&gt; &lt;span class=&#34;label&#34;&gt;label:&lt;/span&gt;&lt;span class=&#34;value&#34;&gt;Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.&lt;/span&gt; &lt;/div&gt; &lt;/body&gt; &lt;/html&gt;"></iframe>

<p>
另外，如果设置为 <code>word-break: break-word;</code> 也是没问题的。
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #531ab6;">!DOCTYPE</span> html&gt;
&lt;<span style="color: #721045;">html</span>&gt;
  &lt;<span style="color: #721045;">head</span>&gt;
    &lt;<span style="color: #721045;">style</span>&gt;
    .box {
      width: 200px;
      border: 1px solid <span style="color: #ffffff; background-color: #000;">#000</span>;
    }

    .value {
      word-break: break-word;
    }
    &lt;/<span style="color: #721045;">style</span>&gt;
  &lt;/<span style="color: #721045;">head</span>&gt;
  &lt;<span style="color: #721045;">body</span>&gt;
    &lt;<span style="color: #721045;">div</span> <span style="color: #005e8b;">class</span>=<span style="color: #3548cf;">"box"</span>&gt;
      &lt;<span style="color: #721045;">span</span> <span style="color: #005e8b;">class</span>=<span style="color: #3548cf;">"label"</span>&gt;label:&lt;/<span style="color: #721045;">span</span>&gt;&lt;<span style="color: #721045;">span</span> <span style="color: #005e8b;">class</span>=<span style="color: #3548cf;">"value"</span>&gt;...................................................................................&lt;/<span style="color: #721045;">span</span>&gt;
    &lt;/<span style="color: #721045;">div</span>&gt;
  &lt;/<span style="color: #721045;">body</span>&gt;
&lt;/<span style="color: #721045;">html</span>&gt;
</pre>
</div>

<iframe style="width: 100%" srcdoc="&lt;!DOCTYPE html&gt; &lt;html&gt; &lt;head&gt; &lt;style&gt; .box {width: 200px; border: 1px solid #000;} .value {word-break: break-word;} &lt;/style&gt; &lt;/head&gt; &lt;body&gt; &lt;div class=&#34;box&#34;&gt; &lt;span class=&#34;label&#34;&gt;label:&lt;/span&gt;&lt;span class=&#34;value&#34;&gt;...................................................................................&lt;/span&gt; &lt;/div&gt; &lt;/body&gt; &lt;/html&gt;"></iframe>

<p>
因为规范中对于 <code>word-break: break-word;</code> 的描述是这样的：
</p>

<blockquote>
<p>
For compatibility with legacy content, the word-break property also
supports a deprecated break-word keyword. When specified, this has <code>the
same effect as word-break: normal and overflow-wrap: anywhere</code>,
regardless of the actual value of the overflow-wrap property.  <a href="https://drafts.csswg.org/css-text/#word-break-property">Source</a>
</p>
</blockquote>

<p>
也就是说， <code>word-break: break-word;</code> 相当于设置了 <code>overflow-wrap: anywhere;</code> ，所以即使是标点符号，也能换行。
</p>

<p>
关于文本换行，<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_text/Wrapping_breaking_text">Wrapping and breaking text</a> 讲得很详细，里面还介绍了 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/wbr">&lt;wbr&gt;</a> (标记一个可换行的位置)，<a href="https://developer.mozilla.org/en-US/docs/Web/CSS/hyphens">hyphens</a> (换行增加连接符 <code>-</code>)，推荐阅读一下。
</p>
</div>
<div id="postamble" class="status">

<p class="author">Author: <a href="mailto:l-yanlei@hotmail.com">Spike Leung</a></p>
<p class="date">Date: 2024-08-04 Sun 00:00</p>
<p class="license">License: <a href="https://www.creativecommons.org/licenses/by-nc/4.0/deed.zh-hans">CC BY-NC 4.0</a></p>
<script src="https://utteranc.es/client.js" repo="Spike-Leung/taxodium" issue-term="pathname" theme="github-light" crossorigin="anonymous" async></script>
</div>
</body>
</html>
